gcolor={
    0:'r',
    1:'c',
    2:'g',
    3:'b',
    4:'y',
    5:"gray",
    6:"magenta",
    7:"m"
}

gmarker={
    0:'.',
    1:'o',
    2:'o',
}

cog = ['課題設定', '解決意向','創造性','論理的思考', '疑う力']
sel = [ '個人的実行力', '内的価値', 'ヴィジョン',
        '自己効力', '成長', '興味', '耐性',  '感情コントロール', '決断力']
oth = ['表現力', '共感・傾聴力', '外交性', '柔軟性', '寛容', '影響力の行使', '情熱・宣教力']
com = ['組織への働きかけ', '地球市民','組織へのコミットメント',  '誠実さ']
cat = ["25項目平均","認知平均","自己平均","他者平均","コミュニティ平均"]
cn = cog+sel+oth+com
bn = ['外向性-内向性', '開放性-保守性', '繊細性-平穏性', '協調性-独立性', '自律性-自由性']
av = ["平均値","モデルスコア","信頼性スコア"]
cn_gp = [c+"_gp" for c in cn]
cn_self = [c+"_self" for c in cn]
cn_gap = [c+"_gap" for c in cn]
cn_growth = [c+"growth" for c in cn]
tre = ['孤独感', '現状への不安感', '自己効力感', '自己肯定感']

cluster_type = {
    5: "堅実思考のエキスパート",
    0: "洞察力に優れたアジテーター",
    2: "ユニークなイノベーター",
    1: "温厚実直なコーディネーター",
    3: "マイペースのオペレーター",
    4: "責任感あるチームリーダー"
}
